Revit 2024 API
SpecTypeId.ThermalResistance Property
 Thermal Resistance, in discipline Energy.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId ThermalResistance { get; }
Visual Basic
Public Shared ReadOnly Property ThermalResistance As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ThermalResistance {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace